Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Either the Git repository is available for everyone to clone or it isn’t.
cs: Repozitář Git je buď dostupný pro všechny a všichni z něj mohou klonovat, nebo dostupný není.

source: Engineers can push any branch whose name starts with "eng-", and tags that start with "rc" followed by a digit.
cs: Skupina engineers mohou odesílat větve, jejichž názvy začínají na „eng-“ a značky, které začínají na „rc“ a pak následuje číslo.

source: Even commits that were on branches that were deleted or commits that were overwritten with an `--amend` commit can be recovered (see _Chapter 9_ for data recovery).
cs: Obnovit lze dokonce i revize na odstraněných větvích nebo revize, které byly přepsány revizí `--amend` (o obnovování dat viz _kapitola 9_.

source: Even if you don’t commit during the weekend, use the staging area on Monday to split your work into at least one commit per issue, with a useful message per commit.
cs: I pokud nebudete během víkendu zapisovat revize, využijte v pondělí oblasti připravených změn a rozdělte svou práci alespoň do stejného počtu revizí, kolik je řešených problémů, a přidejte k nim vysvětlující zprávy.

source: Even if you set up and run your own server internally, you may still want to use a public hosting site for your open source code — it’s generally easier for the open source community to find and help you with.
cs: Dokonce i když budete nastavovat a spouštět interně svůj vlastní server, budete možná přesto chtít použít veřejné hostingové místo pro otevřený zdrojový kód – komunita open source vývojářů si vás tak snáze najde a pomůže vám.

source: Even the popular Mac OS X operating system includes the rcs command when you install the Developer Tools.
cs: Dokonce i populární operační systém Mac OS X obsahuje po nainstalování vývojářských nástrojů (Developer Tools) příkaz rcs.

source: Even though the examples in this book show software source code as the files under version control, in reality any type of file on a computer can be placed under version control.
cs: Příklady verzovaných souborů jsou v této knize ilustrovány na zdrojových textech programů, avšak ve skutečnosti lze správu verzí použít pro libovolný typ souborů.

source: Every checkout is really a full backup of all the data (see Figure 1-3).
cs: Každá lokální kopie (checkout) představuje úplnou zálohu všech dat (viz obrázek 1-3).

source: Every time anyone clones this repository, they will have to clone all 2MB just to get this tiny project, because you accidentally added a big file.
cs: Pokaždé, když bude někdo tento repozitář klonovat, bude muset pro získání malinkého projektu naklonovat celé 2 MB jen proto, že jste jednou omylem přidali velký soubor.

source: Every time you commit, it moves forward automatically.
cs: Pokaždé, když zapíšete novou revizi, větev se automaticky posune vpřed.

source: Every time you commit, or save the state of your project in Git, it basically takes a picture of what all your files look like at that moment and stores a reference to that snapshot.
cs: Pokaždé, když v systému zapíšete (uložíte) stav projektu, Git v podstatě „vyfotí“, jak vypadají všechny vaše soubory v daném okamžiku, a uloží reference na tento snímek.

source: Every time you perform a commit, you’re recording a snapshot of your project that you can revert to or compare to later.
cs: Pokaždé, když zapíšete revizi, nahrajete snímek svého projektu, k němuž se můžete později vrátit nebo ho můžete použít k srovnání.

source: Every time your branch tip is updated for any reason, Git stores that information for you in this temporary history.
cs: Pokaždé, když je z nějakého důvodu aktualizován vrchol větve, Git tuto informaci uloží v dočasné historii reflog.

source: Every version of every file for the history of the project is pulled down when you run `git clone`.
cs: Po spuštění příkazu `git clone` budou k historii projektu staženy všechny verze všech souborů.

source: Everyone knows that Word is the most horrific editor around; but, oddly, everyone uses it.
cs: Je všeobecně známo, že Word je nejpříšernější editor na světě, přesto ho však – bůhví proč – všichni používají.

source: Everything in Git is check-summed before it is stored and is then referred to by that checksum.
cs: Než je v systému Git cokoli uloženo, je nejprve proveden kontrolní součet, který je potom používán k identifikaci uloženého souboru.

source: Everything is set up.
cs: Nyní je vše nastaveno.

source: Everything merges cleanly, and Jessica’s history looks like Figure 5-9.
cs: Začlenění proběhne čistě a historie Jessicy bude vypadat jako na obrázku 5-9.

source: Example history before a cherry pick.
cs: Uvažovaná historie před částečným převzetím

source: Example history for range selection.
cs: Příklad historie revizí pro výběr intervalu

source: Examples include e-mailing a list, notifying a continuous integration server, or updating a ticket-tracking system — you can even parse the commit messages to see if any tickets need to be opened, modified, or closed.
cs: Ukázkové skripty obsahují odeslání seznamu e-mailem, oznámení serveru průběžné integrace nebo aktualizaci systému sledování tiketů. Možné je dokonce i analyzovat zprávy k revizím a zjistit, zda je některé tikety třeba otevřít, upravit nebo zavřít.

source: Exiting non-zero from this hook aborts the commit, although you can bypass it with `git commit --no-verify`.
cs: Je-li výstup tohoto zásuvného modulu nenulový, zapisování bude přerušeno. Ale můžete to obejít zadáním příkazu `git commit --no-verify`.

source: Fast-forwarding the master branch.
cs: „Rychle vpřed“ po hlavní větvi

source: Fast-forwarding your master branch to include the client branch changes.
cs: Posun hlavní větve rychle vpřed na konec změn přeskládaných z větve client

source: Feel free to give out that URL and post it on your web site or what have you.
cs: Nemusíte se bát poskytnout tuto adresu ostatním nebo ji třeba zveřejnit na svých webových stránkách.

source: Fetch more commits, and merge them into your work.
cs: Vyzvedli jste další revize a začlenili je do své práce.

source: Figure 3-11 illustrates the result.
cs: Obrázek 3-11 ukazuje výsledek.

source: Figure 3-16 highlights the three snapshots that Git uses to do its merge in this case.
cs: Obrázek 3-16 označuje ony tři snímky, které Git v tomto případě použije ke sloučení.

source: Figure 3-29 illustrates this process.
cs: Tento proces je naznačen na obrázku 3-29.

source: Figure 3-7 illustrates the result.
cs: Obrázek 3-7 ukazuje výsledek.

source: Figure 3-8 shows the result.
cs: Výsledek ukazuje obrázek 3-8.

source: Final commit history.
cs: Konečná historie revizí

source: Finally, Git looks for configuration values in the config file in the Git directory (`.git/config`) of whatever repository you’re currently using.
cs: Nakonec vyhledává Git konfigurační hodnoty v konfiguračním souboru v adresáři Git (`.git/config`) v právě používaném repozitáři.

source: Finally, John’s commit history looks like Figure 5-6.
cs: Johnova historie revizí bude nakonec vypadat jako na obrázku 5-6.

source: Finally, `git apply` is an "apply all or abort all" model where either everything is applied or nothing is, whereas `patch` can partially apply patchfiles, leaving your working directory in a weird state.
cs: A konečně příkaz `git apply` pracuje na principu „aplikuj vše, nebo zruš vše“. Buď jsou tedy aplikovány všechny soubory, nebo žádný. Naproti tomu příkaz `patch` může aplikovat soubory záplaty jen částečně a zanechat váš pracovní adresář v neurčitém stavu.

source: Finally, back on your workstation, run `git clone git@gitserver:gitolite-admin`.
cs: Nakonec přejděte zpět na pracovní stanici a spusťte `git clone git@gitserver:gitolite-admin`.

source: Finally, she merges John’s work into her own `featureA` branch:
cs: Nakonec začlení Johnovu práci do své vlastní větve `featureA`:

source: Finally, the `post-merge` hook runs after a successful `merge` command.
cs: A konečně můžeme zmínit zásuvný modul `post-merge`, který se spouští po úspěšném provedení příkazu `merge`.

source: Finally, the command tells you which branch you’re on.
cs: Příkaz vám dále sděluje, na jaké větvi (branch) se nacházíte.

source: Finally, the server responds with a success (or failure) indication:
cs: Na závěr procesu server oznámí, zda se akce zdařila, nebo nezdařila:

source: Finally, you ask `filter-branch` to rewrite your history only from the `6df7640` commit up, because you know that is where this problem started.
cs: A konečně požádáte příkaz `filter-branch`, aby přepsal historii až od revize `6df7640` dále, neboť víte, že tady problém začíná.

source: Finally, you don’t need to be in interactive add mode to do the partial-file staging — you can start the same script by using `git add -p` or `git add --patch` on the command line.
cs: K částečné přípravě souboru ostatně nemusíte být nutně v režimu interaktivního přidávání. Stejný skript spustíte také příkazem `git add -p` nebo `git add --patch` z příkazového řádku.

source: Finally, you went back to your server branch and did a few more commits.
cs: Nakonec jste se vrátili na větev `server` a zapsali tu další revize.

source: Finally, you’ll write your zlib-deflated content to an object on disk.
cs: Na závěr zapíšete obsah zkomprimovaný metodou zlib do objektu na disku.

source: First it confirms where you want to save the key (`.ssh/id_rsa`), and then it asks twice for a passphrase, which you can leave empty if you don’t want to type a password when you use the key.
cs: Program nejprve potvrdí, kam chcete klíč uložit (`.ssh/id_rsa`), a poté se dvakrát zeptá na přístupové heslo. Pokud nechcete při používání klíče zadávat heslo, můžete ho nyní nechat prázdné.

source: First things first—you have to install it.
cs: Instalaci můžete provést celou řadou způsobů.

source: First you have to find it.
cs: Nejprve ho budete muset najít.

source: First you need to enable the hook:
cs: Nejprve ze všeho budete muset zapnout zásuvný modul:

source: First you notice the `.gitmodules` file.
cs: Zaprvé si všimnete souboru `.gitmodules`.

source: First you run `git bisect start` to get things going, and then you use `git bisect bad` to tell the system that the current commit you’re on is broken.
cs: Nejprve spustíte příkaz `git bisect start`, jímž celý proces zahájíte, a poté použijete příkaz `git bisect bad`, jímž systému oznámíte, že aktuální revize, na níž se právě nacházíte, obsahuje chybu.

source: First you’ll move the tags so they’re actual tags rather than strange remote branches, and then you’ll move the rest of the branches so they’re local.
cs: Nejprve přesuňte značky tak, aby se z nich staly skutečné značky, a ne podivné vzdálené větve. V dalším kroku přesunete zbytek větví a uděláte z nich větve lokální.

source: First, add a large object to your history:
cs: Nejprve do historie přidejte velký objekt:

source: First, create a new file and save its contents in your database:
cs: Vytvořte nový soubor a uložte jeho obsah do své databáze:

source: First, if it isn’t yet clear, Git is fundamentally a content-addressable filesystem with a VCS user interface written on top of it.
cs: Pokud tato informace ještě nezazněla dostatečně jasně, můžeme začít konstatováním, že Git je ve své podstatě obsahově adresovatelný systém souborů s uživatelským rozhraním VCS na svém vrcholu.

source: First, it works offline, unlike the real `svn log` command, which asks the Subversion server for the data.
cs: Zaprvé to, že pracuje i off-line, na rozdíl od skutečného příkazu `svn log`, který si data vyžádá ze serveru Subversion.

source: First, let’s review where your repository is at this point:
cs: Nejprve se podíváme, kde se váš repozitář v současnosti nachází:

source: First, let’s say you’re working on your project and have a couple of commits already (see Figure 3-10).
cs: Řekněme, že pracujete na projektu a už jste vytvořili několik revizí (viz obrázek 3-10).

source: First, she switches back to her `master` branch to integrate all this work:
cs: Nejprve se přepne zpět na svou větev `master`, aby do ní mohla vše integrovat:

source: First, the ACL file is in a different place, because this script runs from your working directory, not from your Git directory.
cs: Zaprvé je soubor ACL na jiném místě, protože se tento skript spouští z vašeho pracovního adresáře, a ne z adresáře Git.

source: First, you again tell it the scope of the bisect by providing the known bad and good commits.
cs: Nejprve opět zadáte poslední známé revize s chybou a bez ní, jimiž vymezíte pracovní rozsah pro příkaz bisect.

source: First, you basically have to use it if you want authenticated write access to your repository over a network.
cs: Především byste ho měli používat vždy, když chcete v síti používat autentizovaný zápis do repozitáře.

source: First, you can inject the SHA-1 checksum of a blob into an `$Id$` field in the file automatically.
cs: První možností je automaticky vložit kontrolní součet SHA-1 blobu do pole `$Id$` v souboru.

source: First, you choose which protocols you want your server to communicate with.
cs: Nejprve určíte, jakými protokoly má váš server komunikovat.

source: First, you create a 'git' user and a `.ssh` directory for that user.
cs: Nejprve vytvoříte uživatele 'git' a adresář `.ssh` pro tohoto uživatele.

source: First, you don’t want to submit any whitespace errors.
cs: Především nechcete, aby revize obsahovaly chyby způsobené prázdnými znaky.

source: First, you initialize a new Git repository and verify that there is nothing in the `objects` directory:
cs: Vytvořme nejprve nový repozitář Git. Můžeme se přesvědčit, že je adresář `objects` prázdný:

source: First, you must be relatively careful when working in the submodule directory.
cs: Zaprvé je třeba, abyste si v adresáři submodulu počínali opatrně.

source: First, you need to add something like the following to the `/etc/gitweb.conf` file:
cs: Nejprve budete muset do souboru `/etc/gitweb.conf` vložit následující:

source: First, you need to get the Git source code, which GitWeb comes with, and generate the custom CGI script:
cs: Nejprve je třeba získat zdrojový kód systému Git, s nímž je GitWeb distribuován, a vygenerovat uživatelský CGI skript:

source: First, you need to require the library and then run `Zlib::Deflate.deflate()` on the content:
cs: Nejprve je třeba vyžádat si knihovnu a poté na obsah spustit příkaz `Zlib::Deflate.deflate()`:

source: First, you need to set up the imap section in your `~/.gitconfig` file.
cs: Nejprve je třeba nastavit sekci „imap“ v souboru `~/.gitconfig`.

source: First, you see this where the hook starts running.
cs: Zaprvé si všimněte místa, kde byl spuštěn zásuvný modul.

source: First, you should check to make sure you don’t already have a key.
cs: Nejprve byste se měli ujistit, že ještě žádný klíč nemáte.

source: First, you’ll probably want to clone the main repository, create a topic branch for the patch or patch series you’re planning to contribute, and do your work there.
cs: Nejprve patrně bude nutné, abyste naklonovali hlavní repozitář, vytvořili tematickou větev pro záplatu nebo sérii záplat, které hodláte vytvořit, a udělali v nich zamýšlenou práci.

source: First, you’ll use the described technique to solve one of the most annoying problems known to humanity: version-controlling Word documents.
cs: Tuto metodu budete využívat především k řešení jednoho z nejpalčivějších problémů, s nímž se lidstvo potýká: verzování dokumentů Word.

source: For a more in-depth look at how Git stores its data and how you can recover data that seems lost, see Chapter 9.
cs: Podrobnější informace o tom, jak Git ukládá data a jak lze obnovit zdánlivě ztracenou práci, najdete v kapitole 9.

source: For a more in-depth tutorial on creating an SSH key on multiple operating systems, see the GitHub guide on SSH keys at `http://github.com/guides/providing-your-ssh-key`.
cs: Budete-li potřebovat podrobnější návod k vytvoření SSH klíče v různých operačních systémech, můžete se na vytváření SSH klíčů podívat do příručky GitHub: `http://github.com/guides/providing-your-ssh-key` (anglicky).

source: For a project with hundreds or thousands of commits, this can literally take hours or even days to finish.
cs: U projektů se stovkami nebo tisíci revizí si můžete bez nadsázky počkat i celé hodiny nebo dny.

source: For another example, if you stage the `benchmarks.rb` file and then edit it, you can use `git diff` to see the changes in the file that are staged and the changes that are unstaged:
cs: V dalším příkladu ukážeme situaci, kdy jste připravili soubor `benchmarks.rb` a poté ho znovu upravili. Příkaz `git diff` můžete nyní použít k zobrazení změn v souboru, které byly připraveny, a změn, které nejsou připraveny:

source: For each reference that this push will update, the `send-pack` process tells the `receive-pack` process that information.
cs: Pro každou referenci, která bude tímto odesláním aktualizována, sdělí proces `send-pack` tuto informaci procesu `receive-pack`.

source: For example, everyone knows to a certain degree what everyone else on the project is doing.
cs: Každý například — do určité míry — ví, co dělají ostatní účastníci projektu a administrátoři mají přesnou kontrolu nad jednotlivými právy.

source: For example, if this patch was applied from the mbox example I just showed, the commit generated would look something like this:
cs: Pokud byl patch aplikován například ze souboru mbox v předchozím příkladu, vygenerovaná revize bude vypadat zhruba takto:

source: For example, if you make two changes to your simplegit.rb file and want to stage one of them and not the other, doing so is very easy in Git.
cs: Pokud například provedete dvě změny v souboru simplegit.rb a chcete k zapsání připravit pouze jednu z nich, není to v systému Git žádný problém.

source: For example, if you want all but `cr-at-eol` to be set, you can do this:
cs: Chcete-li například zapnout všechny funkce kromě `cr-at-eol`, zadejte příkaz v tomto tvaru:

source: For example, if you want to change the last three commit messages, or any of the commit messages in that group, you supply as an argument to `git rebase -i` the parent of the last commit you want to edit, which is `HEAD~2^` or `HEAD~3`.
cs: Pokud chcete například změnit zprávy u posledních tří revizí nebo jakoukoli zprávu k revizi z této skupiny, přidejte jako parametr k příkazu `git rebase -i` rodiče poslední revize, kterou chcete upravovat, v tomto případě tedy `HEAD~2^` nebo `HEAD~3`.

source: For example, if you want to clone the Ruby Git library called Grit, you can do so like this:
cs: Pokud například chcete naklonovat knihovnu Ruby Git nazvanou Grit, můžete to provést následovně:

source: For example, if you want to fetch all the information that Paul has but that you don’t yet have in your repository, you can run `git fetch pb`:
cs: Pokud například chcete vyzvednout (fetch) všechny informace, které má Paul, ale vy je ještě nemáte ve svém repozitáři, můžete spustit příkaz `git fetch pb`:

source: For example, if you want to see some abbreviated stats for each commit, you can use the `--stat` option:
cs: Pokud například chcete zobrazit některé stručné statistiky pro každou revizi, použijte parametr `--stat`:

source: For example, if you want to submit a second topic of work to the project, don’t continue working on the topic branch you just pushed up — start over from the main repository’s `master` branch:
cs: Pokud například chcete do projektu přispět druhým tématem, nerozvíjejte svou práci v tematické větvi, kterou jste právě odeslali. Začněte znovu od začátku z větve `master` hlavního repozitáře:

source: For example, if your contributor sends you two patches and you create a branch called `contrib` and applied those patches there, you can run this:
cs: Pokud vám například přispěvatel pošle dvě záplaty a vy vytvoříte větev s názvem `contrib`, do níž tyto záplaty aplikujete, můžete použít tento příkaz:

source: For example, if you’re on a system that has yum (such as Fedora) or apt-get (such as a Debian based system), you can use one of these commands to install all of the dependencies:
cs: Pokud používáte systém s nástrojem yum (například u distribuce Fedora) nebo apt-get (například distribuce odvozené od Debianu), můžete k instalaci použít jeden z následujících příkazů:

source: For example, if you’ve added a line in a file on the `master` branch, a direct comparison of the snapshots will look like the topic branch is going to remove that line.
cs: Pokud jste například do souboru ve větvi `master` přidali jeden řádek, přímé srovnání snímků bude vypadat, jako by měla tematická větev tento řádek odstranit.

source: For example, in the history listed earlier, `HEAD~3` would be
cs: Například v historii naznačené výše by `HEAD~3` znamenalo

source: For example, let’s say you’ve changed two files and want to commit them as two separate changes, but you accidentally type `git add *` and stage them both.
cs: Řekněme například, že jste změnili dva soubory a chcete je zapsat jako dvě oddělené změny. Jenže omylem jste zadali příkaz `git add *` a oba soubory jste tím připravili k zapsání.

source: For example, my Grit repository looks something like this.
cs: Například můj repozitář Grit vypadá takto:

source: For example, perhaps the Makefile (or some other program) is really not supposed to be changed by just anyone, because a lot of things depend on it or would break if the changes are not done _just right_.
cs: Například soubor Makefile (a možná některé programy) by asi neměl kdokoliv měnit, protože je na něm závislá řada dalších věcí. Pokud se neupraví _správným způsobem_, něco by se pokazilo.

source: For example, running a `git log` at 09:00 on your computer with your timezone currently 3 hours ahead of UTC, makes the following two commands equivalent:
cs: Pokud například na vašem počítači spustíte `git log` v 09:00 a vaše časové pásmo je vůči greenwichskému času posunuto o tři hodiny vpřed, pak se výsledek následujících dvou příkazů shoduje:

source: For example, say you have a commit history that looks like Figure 6-1.
cs: Předpokládejme tedy, že máte historii revizí jako na obrázku 6-1.

source: For example, say you have some test files in a `test/` subdirectory, and it doesn’t make sense to include them in the tarball export of your project.
cs: Řekněme například, že máte v podadresáři `test/` několik testovacích souborů, které by nemělo smysl zahrnovat do exportu tarballu vašeho projektu.

source: For example, say you run `git push origin master` in your project, and `origin` is defined as a URL that uses the SSH protocol.
cs: Řekněme například, že ve svém projektu spustíte příkaz `git push origin master` a `origin` je definován jako URL používající protokol SSH.

source: For example, suppose you have a project that looks like Figure 5-26.
cs: Dejme tomu, že máme projekt, který vypadá jako na obrázku 5-26.

source: For example, suppose you want to split the middle commit of your three commits.
cs: Řekněme, že chcete rozdělit třeba prostřední ze svých tří revizí.

source: For example, the most recent tree in the simplegit project may look something like this:
cs: Nejnovější strom v projektu „simplegit“ může vypadat například takto:

source: For example, this command gets the list of commits made in the last two weeks:
cs: Například tento příkaz zobrazí seznam všech revizí pořízených za poslední dva týdny (2 weeks):

source: For example, to browse the history of the project, Git doesn’t need to go out to the server to get the history and display it for you—it simply reads it directly from your local database.
cs: Pokud chcete například procházet historii projektu, Git kvůli tomu nemusí vyhledávat informace na serveru — načte je jednoduše přímo z vaší lokální databáze.
